Revit 2024 API
ParameterFilterElement.ClearRules Method
 Removes all rules from this filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void ClearRules()
Visual Basic
Public Sub ClearRules
Visual C++
public:
void ClearRules()
See Also
ParameterFilterElement Class
Autodesk.Revit.DB Namespace